/* XMSG: Placeholder text in chart when there is no data */
"No Data" = "لا توجد بيانات";

/* XBUT: Save action in inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Save" = "حفظ";

/* XBUT: Re-enter action available in saved state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Re-enter Signature" = "إعادة إدخال التوقيع";

/* XBUT: Clear action of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Clear" = "مسح";

/* XBUT: Cancel action of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Cancel" = "إلغاء";

/* XTIT: Title of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Signature" = "التوقيع";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Tap to Sign" = "النقر للتسجيل";

/* XACT: The accessibility label for the signature area */
"Signature Area" = "منطقة التوقيع";

/* XACT: The accessibility hint for the signature area */
"Double tap and drag to sign" = "انقر نقرًا مزدوجًا واسحب للتوقيع";

/* XACT: The accessibility label for the signature image */
"Signature Image" = "صورة التوقيع";

/* XACT: The accessibility label for the signature line */
"Signature Line" = "سطر التوقيع";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Canceled" = "ملغى";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Next" = "التالي";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Ok" = "موافق";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Status" = "الحالة";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"User canceled Onboarding" = "قام المستخدم بإلغاء بدء التشغيل";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Without consent you will not be able to continue onboarding." = "دون الموافقة لن تصبح قادرًا على متابعة بدء التشغيل.";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Give Consent" = "منح الموافقة";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Quit" = "إنهاء";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Back" = "الخلف";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Step" = "الخطوة";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"of" = "من";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Are you sure you want to quit the onboarding process?" = "هل تريد بالتأكيد الخروج من عملية بدء التشغيل؟";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Want Data Privacy?" = "هل تريد خصوصية البيانات؟";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Be wise about your data" = "كن حكيمًا بشأن بياناتك";

/* XBUT: Not Now action title in UserConsentForm */
"Not Now" = "ليس الآن";

/* XBUT: Allow action title in UserConsentForm */
"Allow" = "سماح";

/* XBUT: Deny action title in UserConsentForm */
"Deny" = "رفض";

/* XBUT: Agree action title in EULAView */
"Agree" = "أوافق";

/* XBUT: Disagree action title in EULAView */
"Disagree" = "لا أوافق";

/* XMSG: Placeholder text in DataTable for loading state */
"Loading..." = "جارٍ التحميل...";

/* XMSG: Placeholder text in DataTable when there is no data */
"There is nothing to display yet" = "لا يوجد شيء لعرضه حتى الآن";

/* XBUT: Default duration foramtter in DataTable */
"%d Hrs %d Min" = "%d من الساعات %d من الدقائق";

/* XBUT: Done action in keyboard toolbar for a Textfield in DataTable */
"Done" = "تم";

/* XBUT: Error messages shown to users in DataTable */
"There are %d errors in the data table." = "هناك %d من الأخطاء في جدول البيانات.";

/* XBUT: voice over label for row header in DataTable */
"row header" = "مقدمة الصف";

/* XBUT: voice over label for row %d in DataTable */
"row %d" = "صف %d";

/* XBUT: voice over label for column %d in DataTable */
"column %d" = "عمود %d";

/* XBUT: voice over label for cell type of `leading accessory` in DataTable */
"leading accessory" = "ملحق بادئ";

/* XBUT: voice over label for cell type of `trailing accessory` in DataTable */
"trailing accessory" = "ملحق لاحق";

/* XBUT: voice over label for cell type of `text` in DataTable */
"text" = "نص";

/* XBUT: voice over label for cell type of `image` in DataTable */
"image" = "صورة";

/* XBUT: voice over label for cell type of `date` in DataTable */
"date" = "تاريخ";

/* XBUT: voice over label for cell type of `time` in DataTable */
"time" = "وقت";

/* XBUT: voice over label for cell type of `duration` in DataTable */
"duration" = "مدة";

/* XBUT: voice over label for cell type of `list item` in DataTable */
"list item" = "عنصر قائمة";

/* XBUT: voice over label for row selection status in DataTable */
"selected" = "محدد";

/* XBUT: voice over label for row selection status in DataTable */
"not selected" = "غير محدد";

/* XBUT: calendar time component label */
"Time" = "الوقت";

/* XBUT: slider default value label formatter for integer */
"Value: %d" = "القيمة: %d";

/* XMSG: a toast message for read-only cell in DataTable */
"Tapped cell is read-only." = "الخلية التي تم النقر عليها هي للقراءة فقط.";

/* Default hint text for Read-only Field for NoteFormView and TextFieldFormView */
"Read-only field" = "حقل للقراءة فقط";

/* Default error text for when the character count reaches the maximum limit for NoteFormView and TextFieldFormView */
"No more characters remaining" = "لا تتبقى حروف أخرى";

/* Default error text for when the character count exceeds the maximum limit for NoteFormView and TextFieldFormView */
"Reduce the number of characters" = "تقليل عدد الحروف";

